app/controllers/freights_controller.rb

SELECT  "power_generators".* FROM "power_generators" WHERE "power_generators"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def new
        power_generator = PowerGenerator.find(params[:id])