app/controllers/power_generators_controller.rb

SELECT "power_generators".* FROM "power_generators"
---
  def index
    @power_generators = PowerGenerator.all

SELECT  "power_generators".* FROM "power_generators" WHERE "power_generators"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @power_generators = PowerGenerator.find(params[:id])